results/html_load/statistics.json
{
  "Step 9: GET /api/orders/my-orders" : {
    "transaction" : "Step 9: GET /api/orders/my-orders",
    "sampleCount" : 304,
    "errorCount" : 290,
    "errorPct" : 95.39474,
    "meanResTime" : 2.1546052631578947,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 5.0,
    "throughput" : 1.0949233733724721,
    "receivedKBytesPerSec" : 0.3359906816708387,
    "sentKBytesPerSec" : 0.2167504817302671
  },
  "Step 5: GET /api/products/3" : {
    "transaction" : "Step 5: GET /api/products/3",
    "sampleCount" : 53,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.3584905660377364,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 5.0,
    "throughput" : 0.18744076164608356,
    "receivedKBytesPerSec" : 0.07687999989390146,
    "sentKBytesPerSec" : 0.03710340695688156
  },
  "Step 10: PUT /api/orders/3/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/3/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.0,
    "medianResTime" : 6.0,
    "minResTime" : 6.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 6.0,
    "throughput" : 166.66666666666666,
    "receivedKBytesPerSec" : 45.572916666666664,
    "sentKBytesPerSec" : 55.17578125
  },
  "Step 5: GET /api/products/2" : {
    "transaction" : "Step 5: GET /api/products/2",
    "sampleCount" : 53,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.6415094339622645,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 5.0,
    "throughput" : 0.18697919239100524,
    "receivedKBytesPerSec" : 0.08253378414134216,
    "sentKBytesPerSec" : 0.03487600170574414
  },
  "Step 5: GET /api/products/1" : {
    "transaction" : "Step 5: GET /api/products/1",
    "sampleCount" : 53,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.792452830188679,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.299999999999997,
    "pct3ResTime" : 5.0,
    "throughput" : 0.1879805918905882,
    "receivedKBytesPerSec" : 0.07765213903292852,
    "sentKBytesPerSec" : 0.037210264937363444
  },
  "Step 10: PUT /api/orders/2/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/2/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.0,
    "medianResTime" : 16.0,
    "minResTime" : 16.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 16.0,
    "throughput" : 62.5,
    "receivedKBytesPerSec" : 17.08984375,
    "sentKBytesPerSec" : 20.69091796875
  },
  "Step 10: PUT /api/orders/4/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/4/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.0,
    "medianResTime" : 8.0,
    "minResTime" : 8.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 8.0,
    "throughput" : 125.0,
    "receivedKBytesPerSec" : 34.1796875,
    "sentKBytesPerSec" : 41.3818359375
  },
  "Step 5: GET /api/products/5" : {
    "transaction" : "Step 5: GET /api/products/5",
    "sampleCount" : 53,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.056603773584906,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 125.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.299999999999997,
    "pct3ResTime" : 125.0,
    "throughput" : 0.18648051454548015,
    "receivedKBytesPerSec" : 0.07994623621627518,
    "sentKBytesPerSec" : 0.03691332856283338
  },
  "Step 5: GET /api/products/4" : {
    "transaction" : "Step 5: GET /api/products/4",
    "sampleCount" : 53,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.9433962264150946,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 16.0,
    "throughput" : 0.18586056950483937,
    "receivedKBytesPerSec" : 0.07859143222226118,
    "sentKBytesPerSec" : 0.034667352319750315
  },
  "Step 10: PUT /api/orders/6/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/6/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.0,
    "medianResTime" : 15.0,
    "minResTime" : 15.0,
    "maxResTime" : 15.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 15.0,
    "throughput" : 66.66666666666667,
    "receivedKBytesPerSec" : 18.229166666666668,
    "sentKBytesPerSec" : 22.0703125
  },
  "Step 10: PUT /api/orders/7/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/7/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.0,
    "medianResTime" : 15.0,
    "minResTime" : 15.0,
    "maxResTime" : 15.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 15.0,
    "throughput" : 66.66666666666667,
    "receivedKBytesPerSec" : 18.229166666666668,
    "sentKBytesPerSec" : 22.0703125
  },
  "Step 2: GET /api/users/me" : {
    "transaction" : "Step 2: GET /api/users/me",
    "sampleCount" : 325,
    "errorCount" : 310,
    "errorPct" : 95.38461,
    "meanResTime" : 2.2123076923076943,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 8.0,
    "throughput" : 1.1006576852999548,
    "receivedKBytesPerSec" : 0.29611925033358394,
    "sentKBytesPerSec" : 0.20930024523499888
  },
  "Step 10: PUT /api/orders/1/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/1/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.0,
    "medianResTime" : 7.0,
    "minResTime" : 7.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 7.0,
    "throughput" : 142.85714285714286,
    "receivedKBytesPerSec" : 39.0625,
    "sentKBytesPerSec" : 47.293526785714285
  },
  "Step 10: PUT /api/orders/5/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/5/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13.0,
    "medianResTime" : 13.0,
    "minResTime" : 13.0,
    "maxResTime" : 13.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 13.0,
    "pct3ResTime" : 13.0,
    "throughput" : 76.92307692307693,
    "receivedKBytesPerSec" : 21.033653846153847,
    "sentKBytesPerSec" : 25.465745192307693
  },
  "Step 10: PUT /api/orders/8/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/8/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.0,
    "medianResTime" : 14.0,
    "minResTime" : 14.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 14.0,
    "throughput" : 71.42857142857143,
    "receivedKBytesPerSec" : 19.53125,
    "sentKBytesPerSec" : 23.646763392857142
  },
  "Step 10: PUT /api/orders/9/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/9/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13.0,
    "medianResTime" : 13.0,
    "minResTime" : 13.0,
    "maxResTime" : 13.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 13.0,
    "pct3ResTime" : 13.0,
    "throughput" : 76.92307692307693,
    "receivedKBytesPerSec" : 21.033653846153847,
    "sentKBytesPerSec" : 25.465745192307693
  },
  "Step 4: GET /api/products" : {
    "transaction" : "Step 4: GET /api/products",
    "sampleCount" : 321,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.5638629283489083,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 5.779999999999973,
    "throughput" : 1.1072210820412878,
    "receivedKBytesPerSec" : 0.4343676163703154,
    "sentKBytesPerSec" : 0.2281144096114378
  },
  "Step 3: PUT /api/users/me" : {
    "transaction" : "Step 3: PUT /api/users/me",
    "sampleCount" : 324,
    "errorCount" : 309,
    "errorPct" : 95.37037,
    "meanResTime" : 2.5370370370370376,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 81.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 6.75,
    "throughput" : 1.1055831951354338,
    "receivedKBytesPerSec" : 0.2883221655354913,
    "sentKBytesPerSec" : 0.3287365203731002
  },
  "Step 7: POST /api/cart" : {
    "transaction" : "Step 7: POST /api/cart",
    "sampleCount" : 314,
    "errorCount" : 299,
    "errorPct" : 95.22293,
    "meanResTime" : 2.3025477707006363,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 12.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 5.0,
    "throughput" : 1.110604147434469,
    "receivedKBytesPerSec" : 0.5397795349079861,
    "sentKBytesPerSec" : 0.30486556362276246
  },
  "Step 10: PUT /api/orders/NOT_FOUND/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/NOT_FOUND/cancel",
    "sampleCount" : 290,
    "errorCount" : 290,
    "errorPct" : 100.0,
    "meanResTime" : 1.534482758620689,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.0,
    "throughput" : 1.0445067946967868,
    "receivedKBytesPerSec" : 0.27234698650785366,
    "sentKBytesPerSec" : 0.22746583517322608
  },
  "Step 10: PUT /api/orders/11/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/11/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12.0,
    "medianResTime" : 12.0,
    "minResTime" : 12.0,
    "maxResTime" : 12.0,
    "pct1ResTime" : 12.0,
    "pct2ResTime" : 12.0,
    "pct3ResTime" : 12.0,
    "throughput" : 83.33333333333333,
    "receivedKBytesPerSec" : 22.786458333333332,
    "sentKBytesPerSec" : 27.669270833333332
  },
  "Step 10: PUT /api/orders/12/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/12/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.0,
    "medianResTime" : 14.0,
    "minResTime" : 14.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 14.0,
    "throughput" : 71.42857142857143,
    "receivedKBytesPerSec" : 19.53125,
    "sentKBytesPerSec" : 23.716517857142858
  },
  "Step 6: POST /api/apply-coupon" : {
    "transaction" : "Step 6: POST /api/apply-coupon",
    "sampleCount" : 316,
    "errorCount" : 158,
    "errorPct" : 50.0,
    "meanResTime" : 3.0000000000000004,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 27.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 6.829999999999984,
    "throughput" : 1.1091688955345422,
    "receivedKBytesPerSec" : 0.3823599805895443,
    "sentKBytesPerSec" : 0.2947703816365857
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3161,
    "errorCount" : 2261,
    "errorPct" : 71.528,
    "meanResTime" : 2.5064852894653598,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 203.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 8.760000000000218,
    "throughput" : 10.559228217624991,
    "receivedKBytesPerSec" : 3.452843069483463,
    "sentKBytesPerSec" : 2.5222185674223927
  },
  "Step 1: POST /api/login" : {
    "transaction" : "Step 1: POST /api/login",
    "sampleCount" : 326,
    "errorCount" : 311,
    "errorPct" : 95.39877,
    "meanResTime" : 2.4141104294478506,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 203.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 6.0,
    "throughput" : 1.0912572220474128,
    "receivedKBytesPerSec" : 0.3218519708323012,
    "sentKBytesPerSec" : 0.2813560973578855
  },
  "Step 10: PUT /api/orders/14/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/14/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.0,
    "medianResTime" : 7.0,
    "minResTime" : 7.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 7.0,
    "throughput" : 142.85714285714286,
    "receivedKBytesPerSec" : 39.0625,
    "sentKBytesPerSec" : 47.433035714285715
  },
  "Step 5: GET /api/products/product_id" : {
    "transaction" : "Step 5: GET /api/products/product_id",
    "sampleCount" : 53,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.433962264150945,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 5.0,
    "throughput" : 0.1871706855391222,
    "receivedKBytesPerSec" : 0.04368534555063497,
    "sentKBytesPerSec" : 0.036556774519359805
  },
  "Step 8: POST /api/checkout" : {
    "transaction" : "Step 8: POST /api/checkout",
    "sampleCount" : 309,
    "errorCount" : 294,
    "errorPct" : 95.14563,
    "meanResTime" : 2.825242718446599,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 21.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 16.0,
    "throughput" : 1.1011685215476228,
    "receivedKBytesPerSec" : 0.2880294028031688,
    "sentKBytesPerSec" : 0.3099611762368546
  },
  "Step 10: PUT /api/orders/10/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/10/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.0,
    "medianResTime" : 15.0,
    "minResTime" : 15.0,
    "maxResTime" : 15.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 15.0,
    "throughput" : 66.66666666666667,
    "receivedKBytesPerSec" : 18.229166666666668,
    "sentKBytesPerSec" : 22.135416666666668
  },
  "Step 10: PUT /api/orders/13/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/13/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.0,
    "medianResTime" : 7.0,
    "minResTime" : 7.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 7.0,
    "throughput" : 142.85714285714286,
    "receivedKBytesPerSec" : 39.0625,
    "sentKBytesPerSec" : 47.433035714285715
  }
}