results/load_report/statistics.json
{
  "Step 10: PUT /api/orders/108/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/108/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.0,
    "medianResTime" : 7.0,
    "minResTime" : 7.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 7.0,
    "throughput" : 142.85714285714286,
    "receivedKBytesPerSec" : 39.0625,
    "sentKBytesPerSec" : 47.57254464285714
  },
  "Step 10: PUT /api/orders/114/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/114/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.0,
    "medianResTime" : 7.0,
    "minResTime" : 7.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 7.0,
    "throughput" : 142.85714285714286,
    "receivedKBytesPerSec" : 39.0625,
    "sentKBytesPerSec" : 47.57254464285714
  },
  "Step 9: GET /api/orders/my-orders" : {
    "transaction" : "Step 9: GET /api/orders/my-orders",
    "sampleCount" : 305,
    "errorCount" : 290,
    "errorPct" : 95.08197,
    "meanResTime" : 1.8459016393442622,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.0,
    "throughput" : 1.0890173492960664,
    "receivedKBytesPerSec" : 0.34502170112543695,
    "sentKBytesPerSec" : 0.21599378746844528
  },
  "Step 5: GET /api/products/3" : {
    "transaction" : "Step 5: GET /api/products/3",
    "sampleCount" : 64,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.2187499999999996,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 6.0,
    "throughput" : 0.2222747037494964,
    "receivedKBytesPerSec" : 0.09116735895975438,
    "sentKBytesPerSec" : 0.042721132941111094
  },
  "Step 5: GET /api/products/2" : {
    "transaction" : "Step 5: GET /api/products/2",
    "sampleCount" : 64,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.1093749999999996,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 5.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.75,
    "pct3ResTime" : 5.0,
    "throughput" : 0.222263896702854,
    "receivedKBytesPerSec" : 0.09810867315399414,
    "sentKBytesPerSec" : 0.04271905582991255
  },
  "Step 5: GET /api/products/1" : {
    "transaction" : "Step 5: GET /api/products/1",
    "sampleCount" : 64,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.3906249999999996,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 6.0,
    "throughput" : 0.22165116262961396,
    "receivedKBytesPerSec" : 0.09156097831281905,
    "sentKBytesPerSec" : 0.043020672434214625
  },
  "Step 5: GET /api/products/5" : {
    "transaction" : "Step 5: GET /api/products/5",
    "sampleCount" : 63,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.0476190476190474,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.0,
    "throughput" : 0.2217544650085534,
    "receivedKBytesPerSec" : 0.09506856458862786,
    "sentKBytesPerSec" : 0.042641123177565486
  },
  "Step 5: GET /api/products/4" : {
    "transaction" : "Step 5: GET /api/products/4",
    "sampleCount" : 63,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.444444444444445,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 6.0,
    "throughput" : 0.2226486709994805,
    "receivedKBytesPerSec" : 0.09414733842067877,
    "sentKBytesPerSec" : 0.04281306987457458
  },
  "Step 2: GET /api/users/me" : {
    "transaction" : "Step 2: GET /api/users/me",
    "sampleCount" : 325,
    "errorCount" : 309,
    "errorPct" : 95.07692,
    "meanResTime" : 1.7876923076923081,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.0,
    "throughput" : 1.0953456236729466,
    "receivedKBytesPerSec" : 0.2956939488473594,
    "sentKBytesPerSec" : 0.20869822912102728
  },
  "Step 4: GET /api/products" : {
    "transaction" : "Step 4: GET /api/products",
    "sampleCount" : 319,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.22884012539185,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 5.800000000000011,
    "throughput" : 1.0912362440948382,
    "receivedKBytesPerSec" : 0.4631413525086461,
    "sentKBytesPerSec" : 0.22402252684475368
  },
  "Step 3: PUT /api/users/me" : {
    "transaction" : "Step 3: PUT /api/users/me",
    "sampleCount" : 323,
    "errorCount" : 307,
    "errorPct" : 95.04644,
    "meanResTime" : 2.4334365325077396,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 5.600000000000023,
    "pct3ResTime" : 16.75999999999999,
    "throughput" : 1.0974673308099512,
    "receivedKBytesPerSec" : 0.2862091221025843,
    "sentKBytesPerSec" : 0.32903248634961296
  },
  "Step 7: POST /api/cart" : {
    "transaction" : "Step 7: POST /api/cart",
    "sampleCount" : 313,
    "errorCount" : 298,
    "errorPct" : 95.207664,
    "meanResTime" : 2.04153354632588,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.0,
    "throughput" : 1.0980298607992816,
    "receivedKBytesPerSec" : 0.28625131991608666,
    "sentKBytesPerSec" : 0.30037614867780366
  },
  "Step 10: PUT /api/orders/NOT_FOUND/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/NOT_FOUND/cancel",
    "sampleCount" : 290,
    "errorCount" : 290,
    "errorPct" : 100.0,
    "meanResTime" : 1.3896551724137942,
    "medianResTime" : 1.0,
    "minResTime" : 0.0,
    "maxResTime" : 4.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 3.0,
    "throughput" : 1.040679815117848,
    "receivedKBytesPerSec" : 0.27134913148092327,
    "sentKBytesPerSec" : 0.22663242067507824
  },
  "Step 10: PUT /api/orders/110/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/110/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.0,
    "medianResTime" : 16.0,
    "minResTime" : 16.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 16.0,
    "throughput" : 62.5,
    "receivedKBytesPerSec" : 17.08984375,
    "sentKBytesPerSec" : 20.81298828125
  },
  "Step 6: POST /api/apply-coupon" : {
    "transaction" : "Step 6: POST /api/apply-coupon",
    "sampleCount" : 314,
    "errorCount" : 105,
    "errorPct" : 33.43949,
    "meanResTime" : 2.6305732484076443,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 6.0,
    "throughput" : 1.0963725432002207,
    "receivedKBytesPerSec" : 0.387905345776347,
    "sentKBytesPerSec" : 0.29007144534373375
  },
  "Step 10: PUT /api/orders/111/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/111/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.0,
    "medianResTime" : 9.0,
    "minResTime" : 9.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 9.0,
    "throughput" : 111.1111111111111,
    "receivedKBytesPerSec" : 30.381944444444446,
    "sentKBytesPerSec" : 37.00086805555556
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3158,
    "errorCount" : 2204,
    "errorPct" : 69.79101,
    "meanResTime" : 2.1424952501583303,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 36.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 8.0,
    "throughput" : 10.540545050983795,
    "receivedKBytesPerSec" : 3.3000807834482067,
    "sentKBytesPerSec" : 2.5192936324493918
  },
  "Step 10: PUT /api/orders/113/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/113/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.0,
    "medianResTime" : 7.0,
    "minResTime" : 7.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 7.0,
    "throughput" : 142.85714285714286,
    "receivedKBytesPerSec" : 39.0625,
    "sentKBytesPerSec" : 47.57254464285714
  },
  "Step 1: POST /api/login" : {
    "transaction" : "Step 1: POST /api/login",
    "sampleCount" : 327,
    "errorCount" : 311,
    "errorPct" : 95.10703,
    "meanResTime" : 1.9418960244648322,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 36.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.0,
    "throughput" : 1.0934699446242744,
    "receivedKBytesPerSec" : 0.3239838378788689,
    "sentKBytesPerSec" : 0.28296173398584845
  },
  "Step 10: PUT /api/orders/112/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/112/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.0,
    "medianResTime" : 6.0,
    "minResTime" : 6.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 6.0,
    "throughput" : 166.66666666666666,
    "receivedKBytesPerSec" : 45.572916666666664,
    "sentKBytesPerSec" : 55.501302083333336
  },
  "Step 10: PUT /api/orders/106/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/106/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.0,
    "medianResTime" : 14.0,
    "minResTime" : 14.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 14.0,
    "throughput" : 71.42857142857143,
    "receivedKBytesPerSec" : 19.53125,
    "sentKBytesPerSec" : 23.78627232142857
  },
  "Step 8: POST /api/checkout" : {
    "transaction" : "Step 8: POST /api/checkout",
    "sampleCount" : 309,
    "errorCount" : 294,
    "errorPct" : 95.14563,
    "meanResTime" : 2.491909385113269,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 23.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 5.5,
    "pct3ResTime" : 18.899999999999977,
    "throughput" : 1.0982566508503493,
    "receivedKBytesPerSec" : 0.2873510556059071,
    "sentKBytesPerSec" : 0.310387594187059
  },
  "Step 10: PUT /api/orders/100/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/100/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.0,
    "medianResTime" : 7.0,
    "minResTime" : 7.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 7.0,
    "throughput" : 142.85714285714286,
    "receivedKBytesPerSec" : 39.0625,
    "sentKBytesPerSec" : 47.57254464285714
  },
  "Step 10: PUT /api/orders/107/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/107/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.0,
    "medianResTime" : 8.0,
    "minResTime" : 8.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 8.0,
    "throughput" : 125.0,
    "receivedKBytesPerSec" : 34.1796875,
    "sentKBytesPerSec" : 41.6259765625
  },
  "Step 10: PUT /api/orders/109/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/109/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.0,
    "medianResTime" : 9.0,
    "minResTime" : 9.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 9.0,
    "throughput" : 111.1111111111111,
    "receivedKBytesPerSec" : 30.381944444444446,
    "sentKBytesPerSec" : 37.00086805555556
  },
  "Step 10: PUT /api/orders/101/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/101/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 6.0,
    "medianResTime" : 6.0,
    "minResTime" : 6.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 6.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 6.0,
    "throughput" : 166.66666666666666,
    "receivedKBytesPerSec" : 45.572916666666664,
    "sentKBytesPerSec" : 55.501302083333336
  },
  "Step 10: PUT /api/orders/102/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/102/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.0,
    "medianResTime" : 16.0,
    "minResTime" : 16.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 16.0,
    "throughput" : 62.5,
    "receivedKBytesPerSec" : 17.08984375,
    "sentKBytesPerSec" : 20.81298828125
  },
  "Step 10: PUT /api/orders/103/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/103/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 13.0,
    "medianResTime" : 13.0,
    "minResTime" : 13.0,
    "maxResTime" : 13.0,
    "pct1ResTime" : 13.0,
    "pct2ResTime" : 13.0,
    "pct3ResTime" : 13.0,
    "throughput" : 76.92307692307693,
    "receivedKBytesPerSec" : 21.033653846153847,
    "sentKBytesPerSec" : 25.615985576923077
  },
  "Step 10: PUT /api/orders/104/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/104/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.0,
    "medianResTime" : 7.0,
    "minResTime" : 7.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 7.0,
    "throughput" : 142.85714285714286,
    "receivedKBytesPerSec" : 39.0625,
    "sentKBytesPerSec" : 47.57254464285714
  },
  "Step 10: PUT /api/orders/105/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/105/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 7.0,
    "medianResTime" : 7.0,
    "minResTime" : 7.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 7.0,
    "throughput" : 142.85714285714286,
    "receivedKBytesPerSec" : 39.0625,
    "sentKBytesPerSec" : 47.57254464285714
  }
}