results/spike_report/statistics.json
{
  "Step 9: GET /api/orders/my-orders" : {
    "transaction" : "Step 9: GET /api/orders/my-orders",
    "sampleCount" : 409,
    "errorCount" : 389,
    "errorPct" : 95.11002,
    "meanResTime" : 2.276283618581907,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 7.0,
    "throughput" : 10.131787554498613,
    "receivedKBytesPerSec" : 3.4872048249851364,
    "sentKBytesPerSec" : 2.0091767071071143
  },
  "Step 10: PUT /api/orders/180/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/180/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12.0,
    "medianResTime" : 12.0,
    "minResTime" : 12.0,
    "maxResTime" : 12.0,
    "pct1ResTime" : 12.0,
    "pct2ResTime" : 12.0,
    "pct3ResTime" : 12.0,
    "throughput" : 83.33333333333333,
    "receivedKBytesPerSec" : 22.786458333333332,
    "sentKBytesPerSec" : 27.750651041666668
  },
  "Step 10: PUT /api/orders/190/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/190/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.0,
    "medianResTime" : 16.0,
    "minResTime" : 16.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 16.0,
    "throughput" : 62.5,
    "receivedKBytesPerSec" : 17.08984375,
    "sentKBytesPerSec" : 20.81298828125
  },
  "Step 5: GET /api/products/3" : {
    "transaction" : "Step 5: GET /api/products/3",
    "sampleCount" : 118,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.02542372881356,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 8.620000000000005,
    "throughput" : 2.3795599830607594,
    "receivedKBytesPerSec" : 0.9759913993022646,
    "sentKBytesPerSec" : 0.4584953946439735
  },
  "Step 10: PUT /api/orders/183/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/183/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.0,
    "medianResTime" : 9.0,
    "minResTime" : 9.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 9.0,
    "throughput" : 111.1111111111111,
    "receivedKBytesPerSec" : 30.381944444444446,
    "sentKBytesPerSec" : 37.00086805555556
  },
  "Step 5: GET /api/products/2" : {
    "transaction" : "Step 5: GET /api/products/2",
    "sampleCount" : 118,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.279661016949153,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 15.910000000000025,
    "throughput" : 2.389341108816264,
    "receivedKBytesPerSec" : 1.0546700988134288,
    "sentKBytesPerSec" : 0.4603800292593042
  },
  "Step 5: GET /api/products/1" : {
    "transaction" : "Step 5: GET /api/products/1",
    "sampleCount" : 118,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.1355932203389845,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 4.1000000000000085,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 19.620000000000005,
    "throughput" : 2.376636455186304,
    "receivedKBytesPerSec" : 0.9817550981873112,
    "sentKBytesPerSec" : 0.4579320871097684
  },
  "Step 10: PUT /api/orders/182/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/182/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 12.0,
    "medianResTime" : 12.0,
    "minResTime" : 12.0,
    "maxResTime" : 12.0,
    "pct1ResTime" : 12.0,
    "pct2ResTime" : 12.0,
    "pct3ResTime" : 12.0,
    "throughput" : 83.33333333333333,
    "receivedKBytesPerSec" : 22.786458333333332,
    "sentKBytesPerSec" : 27.750651041666668
  },
  "Step 10: PUT /api/orders/184/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/184/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.0,
    "medianResTime" : 17.0,
    "minResTime" : 17.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 17.0,
    "throughput" : 58.8235294117647,
    "receivedKBytesPerSec" : 16.08455882352941,
    "sentKBytesPerSec" : 19.588694852941174
  },
  "Step 10: PUT /api/orders/181/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/181/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.0,
    "medianResTime" : 18.0,
    "minResTime" : 18.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 18.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 18.0,
    "throughput" : 55.55555555555555,
    "receivedKBytesPerSec" : 15.190972222222223,
    "sentKBytesPerSec" : 18.50043402777778
  },
  "Step 5: GET /api/products/5" : {
    "transaction" : "Step 5: GET /api/products/5",
    "sampleCount" : 116,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.146551724137932,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 10.489999999999995,
    "throughput" : 2.3689907282604254,
    "receivedKBytesPerSec" : 1.0156122360413349,
    "sentKBytesPerSec" : 0.45423737899767186
  },
  "Step 5: GET /api/products/4" : {
    "transaction" : "Step 5: GET /api/products/4",
    "sampleCount" : 117,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.059829059829061,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 20.0,
    "pct1ResTime" : 4.200000000000003,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 17.65999999999991,
    "throughput" : 2.3594893822977796,
    "receivedKBytesPerSec" : 0.9977137720067759,
    "sentKBytesPerSec" : 0.452310301843225
  },
  "Step 2: GET /api/users/me" : {
    "transaction" : "Step 2: GET /api/users/me",
    "sampleCount" : 600,
    "errorCount" : 571,
    "errorPct" : 95.166664,
    "meanResTime" : 2.4883333333333333,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 10.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 6.0,
    "throughput" : 11.641669415394167,
    "receivedKBytesPerSec" : 3.1409201345097886,
    "sentKBytesPerSec" : 2.2168436766332293
  },
  "Step 10: PUT /api/orders/198/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/198/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 16.0,
    "medianResTime" : 16.0,
    "minResTime" : 16.0,
    "maxResTime" : 16.0,
    "pct1ResTime" : 16.0,
    "pct2ResTime" : 16.0,
    "pct3ResTime" : 16.0,
    "throughput" : 62.5,
    "receivedKBytesPerSec" : 17.08984375,
    "sentKBytesPerSec" : 20.81298828125
  },
  "Step 10: PUT /api/orders/189/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/189/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.0,
    "medianResTime" : 9.0,
    "minResTime" : 9.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 9.0,
    "throughput" : 111.1111111111111,
    "receivedKBytesPerSec" : 30.381944444444446,
    "sentKBytesPerSec" : 37.00086805555556
  },
  "Step 10: PUT /api/orders/179/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/179/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 11.0,
    "medianResTime" : 11.0,
    "minResTime" : 11.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 11.0,
    "pct2ResTime" : 11.0,
    "pct3ResTime" : 11.0,
    "throughput" : 90.9090909090909,
    "receivedKBytesPerSec" : 24.857954545454547,
    "sentKBytesPerSec" : 30.2734375
  },
  "Step 10: PUT /api/orders/195/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/195/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.0,
    "medianResTime" : 17.0,
    "minResTime" : 17.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 17.0,
    "throughput" : 58.8235294117647,
    "receivedKBytesPerSec" : 16.08455882352941,
    "sentKBytesPerSec" : 19.588694852941174
  },
  "Step 4: GET /api/products" : {
    "transaction" : "Step 4: GET /api/products",
    "sampleCount" : 600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.1300000000000017,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 19.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 7.0,
    "throughput" : 11.539571112606982,
    "receivedKBytesPerSec" : 4.8975562554091745,
    "sentKBytesPerSec" : 2.366438479661506
  },
  "Step 3: PUT /api/users/me" : {
    "transaction" : "Step 3: PUT /api/users/me",
    "sampleCount" : 600,
    "errorCount" : 571,
    "errorPct" : 95.166664,
    "meanResTime" : 2.9683333333333346,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 26.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 18.99000000000001,
    "throughput" : 11.532695190866106,
    "receivedKBytesPerSec" : 3.0076045210567792,
    "sentKBytesPerSec" : 3.45635475531465
  },
  "Step 10: PUT /api/orders/185/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/185/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.0,
    "medianResTime" : 8.0,
    "minResTime" : 8.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 8.0,
    "throughput" : 125.0,
    "receivedKBytesPerSec" : 34.1796875,
    "sentKBytesPerSec" : 41.6259765625
  },
  "Step 10: PUT /api/orders/186/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/186/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18.0,
    "medianResTime" : 18.0,
    "minResTime" : 18.0,
    "maxResTime" : 18.0,
    "pct1ResTime" : 18.0,
    "pct2ResTime" : 18.0,
    "pct3ResTime" : 18.0,
    "throughput" : 55.55555555555555,
    "receivedKBytesPerSec" : 15.190972222222223,
    "sentKBytesPerSec" : 18.50043402777778
  },
  "Step 10: PUT /api/orders/187/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/187/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 9.0,
    "medianResTime" : 9.0,
    "minResTime" : 9.0,
    "maxResTime" : 9.0,
    "pct1ResTime" : 9.0,
    "pct2ResTime" : 9.0,
    "pct3ResTime" : 9.0,
    "throughput" : 111.1111111111111,
    "receivedKBytesPerSec" : 30.381944444444446,
    "sentKBytesPerSec" : 37.00086805555556
  },
  "Step 10: PUT /api/orders/188/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/188/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 10.0,
    "medianResTime" : 10.0,
    "minResTime" : 10.0,
    "maxResTime" : 10.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 10.0,
    "pct3ResTime" : 10.0,
    "throughput" : 100.0,
    "receivedKBytesPerSec" : 27.34375,
    "sentKBytesPerSec" : 33.30078125
  },
  "Step 10: PUT /api/orders/193/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/193/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 11.0,
    "medianResTime" : 11.0,
    "minResTime" : 11.0,
    "maxResTime" : 11.0,
    "pct1ResTime" : 11.0,
    "pct2ResTime" : 11.0,
    "pct3ResTime" : 11.0,
    "throughput" : 90.9090909090909,
    "receivedKBytesPerSec" : 24.857954545454547,
    "sentKBytesPerSec" : 30.2734375
  },
  "Step 7: POST /api/cart" : {
    "transaction" : "Step 7: POST /api/cart",
    "sampleCount" : 495,
    "errorCount" : 470,
    "errorPct" : 94.94949,
    "meanResTime" : 2.442424242424244,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 6.0400000000000205,
    "throughput" : 10.783373997908678,
    "receivedKBytesPerSec" : 2.811148674407459,
    "sentKBytesPerSec" : 2.9530676452487796
  },
  "Step 10: PUT /api/orders/NOT_FOUND/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/NOT_FOUND/cancel",
    "sampleCount" : 389,
    "errorCount" : 389,
    "errorPct" : 100.0,
    "meanResTime" : 1.7429305912596404,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 6.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 3.0,
    "pct3ResTime" : 4.100000000000023,
    "throughput" : 9.635868218974487,
    "receivedKBytesPerSec" : 2.5124773578771364,
    "sentKBytesPerSec" : 2.0984361453430767
  },
  "Step 10: PUT /api/orders/197/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/197/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14.0,
    "medianResTime" : 14.0,
    "minResTime" : 14.0,
    "maxResTime" : 14.0,
    "pct1ResTime" : 14.0,
    "pct2ResTime" : 14.0,
    "pct3ResTime" : 14.0,
    "throughput" : 71.42857142857143,
    "receivedKBytesPerSec" : 19.53125,
    "sentKBytesPerSec" : 23.78627232142857
  },
  "Step 10: PUT /api/orders/192/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/192/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.0,
    "medianResTime" : 8.0,
    "minResTime" : 8.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 8.0,
    "throughput" : 125.0,
    "receivedKBytesPerSec" : 34.1796875,
    "sentKBytesPerSec" : 41.6259765625
  },
  "Step 10: PUT /api/orders/194/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/194/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 23.0,
    "medianResTime" : 23.0,
    "minResTime" : 23.0,
    "maxResTime" : 23.0,
    "pct1ResTime" : 23.0,
    "pct2ResTime" : 23.0,
    "pct3ResTime" : 23.0,
    "throughput" : 43.47826086956522,
    "receivedKBytesPerSec" : 11.88858695652174,
    "sentKBytesPerSec" : 14.478600543478262
  },
  "Step 10: PUT /api/orders/196/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/196/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17.0,
    "medianResTime" : 17.0,
    "minResTime" : 17.0,
    "maxResTime" : 17.0,
    "pct1ResTime" : 17.0,
    "pct2ResTime" : 17.0,
    "pct3ResTime" : 17.0,
    "throughput" : 58.8235294117647,
    "receivedKBytesPerSec" : 16.08455882352941,
    "sentKBytesPerSec" : 19.588694852941174
  },
  "Step 10: PUT /api/orders/191/cancel" : {
    "transaction" : "Step 10: PUT /api/orders/191/cancel",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.0,
    "medianResTime" : 8.0,
    "minResTime" : 8.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 8.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 8.0,
    "throughput" : 125.0,
    "receivedKBytesPerSec" : 34.1796875,
    "sentKBytesPerSec" : 41.6259765625
  },
  "Step 6: POST /api/apply-coupon" : {
    "transaction" : "Step 6: POST /api/apply-coupon",
    "sampleCount" : 552,
    "errorCount" : 183,
    "errorPct" : 33.152172,
    "meanResTime" : 3.7735507246376807,
    "medianResTime" : 3.0,
    "minResTime" : 2.0,
    "maxResTime" : 24.0,
    "pct1ResTime" : 5.699999999999989,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 9.470000000000027,
    "throughput" : 11.504314117794173,
    "receivedKBytesPerSec" : 4.071249211944062,
    "sentKBytesPerSec" : 3.0453314524196573
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 5304,
    "errorCount" : 3574,
    "errorPct" : 67.38311,
    "meanResTime" : 2.9521116138763155,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 63.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 12.0,
    "throughput" : 89.3546050304082,
    "receivedKBytesPerSec" : 28.463788663050252,
    "sentKBytesPerSec" : 21.326158022582927
  },
  "Step 1: POST /api/login" : {
    "transaction" : "Step 1: POST /api/login",
    "sampleCount" : 609,
    "errorCount" : 580,
    "errorPct" : 95.2381,
    "meanResTime" : 3.627257799671598,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 63.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 62.0,
    "throughput" : 10.290464845136109,
    "receivedKBytesPerSec" : 3.0444209290143798,
    "sentKBytesPerSec" : 2.644215283410216
  },
  "Step 8: POST /api/checkout" : {
    "transaction" : "Step 8: POST /api/checkout",
    "sampleCount" : 443,
    "errorCount" : 421,
    "errorPct" : 95.03386,
    "meanResTime" : 2.9255079006772013,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 23.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 7.7999999999999545,
    "pct3ResTime" : 17.0,
    "throughput" : 10.244195726574786,
    "receivedKBytesPerSec" : 2.680533534999075,
    "sentKBytesPerSec" : 2.8964910594533344
  }
}